red-crypto/Ball-balancer-stm32/ball-balancer-1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */


/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define X_POS_Pin GPIO_PIN_0
#define X_POS_GPIO_Port GPIOC
#define Y_NEG_Pin GPIO_PIN_1
#define Y_NEG_GPIO_Port GPIOC
#define X_POSC2_Pin GPIO_PIN_2
#define X_POSC2_GPIO_Port GPIOC
#define Y_POS_Pin GPIO_PIN_3
#define Y_POS_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define MOTOR_C_STEP_Pin GPIO_PIN_6
#define MOTOR_C_STEP_GPIO_Port GPIOA
#define MOTOR_C_DIR_Pin GPIO_PIN_7
#define MOTOR_C_DIR_GPIO_Port GPIOA
#define MOT_EN_Pin GPIO_PIN_5
#define MOT_EN_GPIO_Port GPIOC
#define MOTOR_B_STEP_Pin GPIO_PIN_8
#define MOTOR_B_STEP_GPIO_Port GPIOA
#define MOTOR_B_DIR_Pin GPIO_PIN_9
#define MOTOR_B_DIR_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define MOTOR_A_DIR_Pin GPIO_PIN_5
#define MOTOR_A_DIR_GPIO_Port GPIOB
#define MOTOR_A_STEP_Pin GPIO_PIN_6
#define MOTOR_A_STEP_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
